# PlasticvinylApplication Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlasticVinyl..::..PlasticvinylApplication Property
PlasticVinyl Class See Also
---
The property labeled "Finish" from the "PlasticVinyl" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string PlasticvinylApplication { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlasticvinylApplication As String
	Get
```

Visual C++
---
```text
public:
static property String^ PlasticvinylApplication {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylApplicationType".
# See Also
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace